In [1]:
import pandas as pd

In [3]:
df = pd.read_csv('salaries.csv')
df

     Name  Salary  Age
0    John   50000   34
1   Sally  120000   45
2  Alyssa   80000   27

In [4]:
df['Salary']

0     50000
1    120000
2     80000
Name: Salary, dtype: int64

In [5]:
df[['Name', 'Salary']]

     Name  Salary
0    John   50000
1   Sally  120000
2  Alyssa   80000

In [6]:
df['Salary'].max()

120000

In [7]:
df['Salary'].mean()

83333.33333333333

In [16]:
ser_of_bool = df['Age'] > 30
df[ser_of_bool]

    Name  Salary  Age
0   John   50000   34
1  Sally  120000   45

In [15]:
df[df['Age'] > 30]

    Name  Salary  Age
0   John   50000   34
1  Sally  120000   45

In [17]:
df['Age'].unique()

array([34, 45, 27])

In [18]:
df.describe()

              Salary        Age
count       3.000000   3.000000
mean    83333.333333  35.333333
std     35118.845843   9.073772
min     50000.000000  27.000000
25%     65000.000000  30.500000
50%     80000.000000  34.000000
75%    100000.000000  39.500000
max    120000.000000  45.000000

In [19]:
import numpy as np
mat = np.arange(0,50).reshape(5,10)
mat

array([[ 0,  1,  2,  3,  4,  5,  6,  7,  8,  9],
       [10, 11, 12, 13, 14, 15, 16, 17, 18, 19],
       [20, 21, 22, 23, 24, 25, 26, 27, 28, 29],
       [30, 31, 32, 33, 34, 35, 36, 37, 38, 39],
       [40, 41, 42, 43, 44, 45, 46, 47, 48, 49]])

In [20]:
pd.DataFrame(mat)

    0   1   2   3   4   5   6   7   8   9
0   0   1   2   3   4   5   6   7   8   9
1  10  11  12  13  14  15  16  17  18  19
2  20  21  22  23  24  25  26  27  28  29
3  30  31  32  33  34  35  36  37  38  39
4  40  41  42  43  44  45  46  47  48  49